Repository: lucifer-mstar1/N.O.K
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Network of Knowledge
ru: Сеть знаний
uz: Bilim tarmog‘i

source: Dashboard
ru: Панель
uz: Boshqaruv

source: Wallet
ru: Кошелёк
uz: Hamyon

source: Courses
ru: Курсы
uz: Kurslar

source: Events
ru: События
uz: Tadbirlar

source: AI Teacher
ru: ИИ-Учитель
uz: AI o‘qituvchi

source: Log out
ru: Выйти
uz: Chiqish

source: Sign in
ru: Войти
uz: Kirish

source: Join for free
ru: Зарегистрироваться
uz: Bepul qo‘shilish

source: After registration we will send you a verification email. Activate your account to sign in.
ru: После регистрации мы отправим письмо для подтверждения. Активируйте аккаунт, чтобы войти.
uz: Ro‘yxatdan o‘tgach, tasdiqlash xati yuboramiz. Akkauntingizni faollashtirib, so‘ng kiring.

source: Check your email
ru: Проверьте почту
uz: Emailingizni tekshiring

source: We sent you a verification link. Open it to activate your account, then you can sign in.
ru: Мы отправили ссылку для подтверждения. Откройте её, чтобы активировать аккаунт, затем войдите.
uz: Biz tasdiqlash havolasini yubordik. Akkauntingizni faollashtiring, so‘ng kirishingiz mumkin.

source: Tip:
ru: Совет:
uz: Maslahat:

source: If you don't see it, check Spam/Junk.
ru: Если письма нет, проверьте Спам.
uz: Ko‘rinmasa, Spam/Junk bo‘limini tekshiring.

source: Your email
ru: Ваш email
uz: Emailingiz

source: Resend
ru: Отправить снова
uz: Qayta yuborish

source: Back to sign in
ru: Назад ко входу
uz: Kirish sahifasiga qaytish

source: Invalid or expired link
ru: Ссылка недействительна или истекла
uz: Havola noto‘g‘ri yoki muddati o‘tgan

source: This verification link is not valid anymore. You can request a new one below.
ru: Эта ссылка больше не действует. Запросите новую ниже.
uz: Bu tasdiqlash havolasi endi ishlamaydi. Quyida yangisini so‘rashingiz mumkin.

source: Send new link
ru: Отправить новую ссылку
uz: Yangi havola yuborish

source: Back to home
ru: На главную
uz: Bosh sahifaga qaytish

source: New here?
ru: Впервые здесь?
uz: Yangi foydalanuvchimisiz?

source: Create an account
ru: Создать аккаунт
uz: Akkaunt yaratish

source: If you just registered, verify your email first.
ru: Если вы только зарегистрировались, сначала подтвердите email.
uz: Agar hozirgina ro‘yxatdan o‘tgan bo‘lsangiz, avval emailingizni tasdiqlang.

source: Email verified. You can sign in now.
ru: Email подтверждён. Теперь вы можете войти.
uz: Email tasdiqlandi. Endi kirishingiz mumkin.

source: Please enter your email.
ru: Введите ваш email.
uz: Iltimos, emailingizni kiriting.

source: If an inactive account exists for that email, we sent a verification link.
ru: Если для этого email есть неактивный аккаунт, мы отправили ссылку для подтверждения.
uz: Agar bu email uchun faol bo‘lmagan akkaunt mavjud bo‘lsa, tasdiqlash havolasini yubordik.

source: ✅ Verify your N.O.K account
ru: ✅ Подтвердите ваш аккаунт N.O.K
uz: ✅ N.O.K akkauntingizni tasdiqlang

source: Hi!
ru: Здравствуйте!
uz: Salom!

source: Please verify your email to activate your N.O.K account:
ru: Подтвердите email, чтобы активировать аккаунт N.O.K:
uz: N.O.K akkauntingizni faollashtirish uchun emailingizni tasdiqlang:

source: If you did not create an account, you can ignore this email.
ru: Если вы не создавали аккаунт, просто игнорируйте это письмо.
uz: Agar akkaunt yaratmagan bo‘lsangiz, bu xatni e’tiborsiz qoldirishingiz mumkin.

source: Apply
ru: Применить
uz: Qo‘llash

source: Built for learners in Uzbekistan
ru: Создано для учащихся Узбекистана
uz: O‘zbekiston o‘quvchilari uchun

source: Learn faster. Stay focused. Win confidence.
ru: Учись быстрее. Сохраняй фокус. Расти в уверенности.
uz: Tezroq o‘rganing. Diqqatni saqlang. Ishonch hosil qiling.

source: A smarter way to learn
ru: Умный способ учиться
uz: O‘rganishning aqlli yo‘li

source: with real teachers
ru: с настоящими преподавателями
uz: haqiqiy ustozlar bilan

source: and a 24/7 AI tutor.
ru: и ИИ-тутором 24/7.
uz: va 24/7 AI yordamchi bilan.

source: N.O.K helps students in Uzbekistan study with structure: clear course parts, progress tracking, and a wallet that makes buying lessons easy.
ru: N.O.K помогает ученикам Узбекистана учиться структурно: понятные части курса, отслеживание прогресса и кошелёк для удобной оплаты.
uz: N.O.K O‘zbekistondagi o‘quvchilarga tartib bilan o‘qishga yordam beradi: kurs bo‘limlari, progress kuzatuvi va dars sotib olishni oson qiladigan hamyon.

source: Start free
ru: Начать бесплатно
uz: Bepul boshlash

source: Explore courses
ru: Смотреть курсы
uz: Kurslarni ko‘rish

source: Instant access
ru: Мгновенный доступ
uz: Tezkor kirish

source: Payme & Click ready (simulation)
ru: Payme и Click готовы (симуляция)
uz: Payme va Click tayyor (simulyatsiya)

source: Mobile-first design
ru: Удобно на телефоне
uz: Telefon uchun qulay dizayn

source: Today’s learning plan
ru: План на сегодня
uz: Bugungi o‘quv reja

source: 15 minutes
ru: 15 минут
uz: 15 daqiqa

source: Momentum
ru: Импульс
uz: Harakat

source: Small steps feel easy, but they build big results.
ru: Маленькие шаги даются легко — и дают большие результаты.
uz: Kichik qadamlar oson, lekin katta natija beradi.

source: Streak
ru: Серия
uz: Ketma-ket

source: Your progress
ru: Ваш прогресс
uz: Sizning progress

source: Level
ru: Уровень
uz: Daraja

source: People continue when they can see progress.
ru: Люди продолжают, когда видят прогресс.
uz: Odamlar progressni ko‘rsa davom ettiradi.

source: so'm
ru: сум

source: Top up via Payme/Click and unlock parts in seconds.
ru: Пополните через Payme/Click и откройте части за секунды.
uz: Payme/Click orqali to‘ldiring va bo‘limlarni soniyalarda oching.

source: AI Tutor
ru: ИИ-тютор

source: Ask questions instead of quitting when you feel stuck.
ru: Задавайте вопросы вместо того, чтобы бросать при трудностях.
uz: Qiyin bo‘lsa tashlab ketmang — savol bering.

source: Try AI
ru: Попробовать ИИ
uz: AI sinab ko‘rish

source: Psychology tip: we use clear steps, progress cues, and quick wins to keep motivation high.
ru: Психология: ясные шаги, подсказки прогресса и быстрые победы поддерживают мотивацию.
uz: Psixologik usul: aniq qadamlar, progress belgisi va tez yutuqlar motivatsiyani oshiradi.

source: Clear structure
ru: Понятная структура
uz: Aniq tuzilma

source: Courses are split into parts so you can buy only what you need and feel constant progress.
ru: Курсы разделены на части — покупайте только нужное и ощущайте постоянный прогресс.
uz: Kurslar bo‘limlarga bo‘lingan: faqat keraklisini sotib oling va doimiy progressni his qiling.

source: Fast checkout
ru: Быстрая оплата
uz: Tez to‘lov

source: Wallet top-ups with Payme & Click flow (simulation). Reduce friction: less thinking, more learning.
ru: Пополнение кошелька через Payme/Click (симуляция). Меньше трения — меньше сомнений, больше обучения.
uz: Payme va Click orqali hamyon to‘ldirish (simulyatsiya). Kamroq o‘ylash — ko‘proq o‘rganish.

source: Social proof
ru: Доверие
uz: Ijtimoiy isbot

source: Reviews, teacher profiles, and recent activity build trust before purchase.
ru: Отзывы, профили преподавателей и активность создают доверие до покупки.
uz: Sharhlar, ustoz profillari va faollik sotib olishdan oldin ishonchni oshiradi.

source: Ready to start?
ru: Готовы начать?
uz: Boshlashga tayyormisiz?

source: Join free today. Your first progress streak starts immediately.
ru: Присоединяйтесь бесплатно — серия прогресса начинается сразу.
uz: Bugun bepul qo‘shiling. Birinchi ketma-ketlik darhol boshlanadi.

source: Create account
ru: Создать аккаунт
uz: Akkaunt yaratish

source: Top up in seconds, then unlock lessons without friction.
ru: Пополняйте за секунды и открывайте уроки без лишних шагов.
uz: Bir necha soniyada to‘ldiring va darslarni oson oching.

source: Balance
ru: Баланс
uz: Balans

source: Referral
ru: Реферал
uz: Referal

source: Copy
ru: Копировать
uz: Nusxa olish

source: Invite friends — when they buy Z, you get a bonus.
ru: Приглашайте друзей — когда они покупают Z, вы получаете бонус.

source: Top up
ru: Пополнить
uz: To‘ldirish

source: Amount (UZS)
ru: Сумма (UZS)

source: Pay with Payme
ru: Оплатить через Payme

source: Pay with Click
ru: Оплатить через Click

source: Tip: lower friction increases conversion. Show the easiest button first.
ru: Совет: меньше трения — больше конверсии. Покажите самый простой вариант первым.

source: Convert
ru: Конвертировать
uz: Konvertatsiya

source: Convert UZS → Z
ru: Конвертировать UZS → Z
uz: UZS → Z aylantirish

source: Withdraw
ru: Вывести
uz: Yechib olish

source: Withdraw Z → UZS
ru: Вывод Z → UZS
uz: Z → UZS yechish

source: Recent transactions
ru: Последние операции
uz: So‘nggi tranzaksiyalar

source: No transactions yet.
ru: Операций пока нет.
uz: Hozircha tranzaksiya yo‘q.

source: Payment simulation
ru: Симуляция оплаты
uz: To‘lov simulyatsiyasi

source: This is a safe demo flow. Replace it with real Payme/Click redirect + callbacks when you have API keys.
ru: Это безопасный демо-поток. Когда будут API-ключи, замените на реальный редирект Payme/Click и колбэки.
uz: Bu xavfsiz demo. API kalitlari bo‘lsa, haqiqiy Payme/Click redirect va callbacklar bilan almashtiring.

source: Top up amount
ru: Сумма пополнения
uz: To‘ldirish miqdori

source: Order
ru: Заказ
uz: Buyurtma

source: Pay now
ru: Оплатить
uz: Hozir to‘lash

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Psychology: remove uncertainty — clear amount, clear action, clear confirmation.
ru: Психология: уберите неопределённость — понятная сумма, действие и подтверждение.
uz: Psixologiya: noaniqlikni kamaytiring — aniq miqdor, aniq amal, aniq tasdiq.

source: Pick a subject, start small, and build a streak.
ru: Выберите предмет, начните с малого и набирайте серию.
uz: Fan tanlang, kichikdan boshlang va ketma-ketlik yarating.

source: Search by subject
ru: Поиск по предмету
uz: Fan bo‘yicha qidirish

source: Search
ru: Искать
uz: Qidirish

source: Teacher
ru: Преподаватель
uz: Ustoz

source: Open
ru: Открыть
uz: Ochish

source: No courses found.
ru: Курсы не найдены.
uz: Kurs topilmadi.

source: Average rating
ru: Средняя оценка
uz: O‘rtacha baho

source: Back
ru: Назад
uz: Orqaga

source: Course parts
ru: Части курса
uz: Kurs bo‘limlari

source: videos
ru: видео
uz: video

source: texts
ru: тексты
uz: matn

source: Buy now
ru: Купить
uz: Sotib olish

source: No parts yet.
ru: Частей пока нет.
uz: Hozircha bo‘lim yo‘q.

source: Psychology: show the next small step. People buy when the decision feels simple.
ru: Психология: покажите следующий маленький шаг. Покупают, когда решение кажется простым.
uz: Psixologiya: keyingi kichik qadamni ko‘rsating. Qaror oson bo‘lsa, odamlar sotib oladi.

source: Reviews
ru: Отзывы
uz: Sharhlar

source: No reviews yet.
ru: Отзывов пока нет.
uz: Hozircha sharh yo‘q.

source: Rating
ru: Оценка
uz: Baho

source: Comment
ru: Комментарий
uz: Izoh

source: Short feedback
ru: Короткий отзыв
uz: Qisqa fikr

source: Send
ru: Отправить
uz: Yuborish

source: Welcome back — let's continue your progress.
ru: С возвращением — продолжим прогресс.
uz: Xush kelibsiz — progressni davom ettiramiz.

source: Don't have an account?
ru: Нет аккаунта?

source: Join N.O.K
ru: Присоединиться к N.O.K
uz: N.O.K ga qo‘shiling

source: Create your account
ru: Создайте аккаунт
uz: Akkauntingizni yarating

source: Start free — you can upgrade anytime when you're ready.
ru: Начните бесплатно — обновиться можно в любой момент.
uz: Bepul boshlang — tayyor bo‘lsangiz istalgan payt yangilashingiz mumkin.

source: Already have an account?
ru: Уже есть аккаунт?
uz: Akkauntingiz bormi?

source: Sign in instead
ru: Войти
uz: Kirish

source: Z Coins
uz: Z tanga

source: Share your code. When friends buy Z, you get a bonus.
uz: Kodingizni ulashing. Do‘stlar Z sotib olsa, siz bonus olasiz.

source: Amount
uz: Miqdor

source: Top up with Payme
uz: Payme orqali

source: Top up with Click
uz: Click orqali

source: Or quick deposit (simulation)
uz: Yoki tez depozit (simulyatsiya)

source: Deposit
uz: Depozit

source: UZS to convert
uz: Aylantirish uchun UZS

source: Z to withdraw
uz: Yechish uchun Z

source: 1% fee. (Simulation)
uz: 1% komissiya. (Simulyatsiya)

source: Continue
uz: Davom etish

source: Don’t have an account?
uz: Akkaunt yo‘qmi?
